<?PHP

//к нам на PHP приходит телефон, пусть $_POST['phone']
//нужно проверять является ли номер корректно введенным украинским и номером мобильного оператора
//рассматривать формат
//+38(098)765-43-21

//усложнение, чтобы регулярка любой вариант рассматривала
//0987654321
//(098)7654321
//098 765 43 21
//098-765-43-21
//+380987654321
//+380 98 765 43 21
//(+380) 987654321
//(+38) 0987654321
//и т.д.
//пробелы в начале и конце можно срезать через trim

$operator = [
    '039' => 'Киевстар (Golden Telecom)',
    '050' => 'МТС',
    '063' => 'lifecell',
    '066' => 'МТС',
    '067' => 'Киевстар',
    '068' => 'Киевстар (Beeline)',
    '091' => 'Utel',
    '092' => 'PEOPLEnet',
    '093' => 'lifecell',
    '094' => 'Интертелеком',
    '095' => 'МТС',
    '096' => 'Киевстар',
    '097' => 'Киевстар',
    '098' => 'Киевстар',
    '099' => 'МТС'
];

$defaultNumber = [
    '+38(098)765-43-21',
    '0987654321',
    '(098)7654321',
    '098 765 43 21',
    '098-765-43-21',
    '+380987654321',
    '+380 98 765 43 21',
    '(+380) 987654321',
    '(+38) 0987654321'
];
$patternStrict = '#^\+38\((039|050|06[3678]|09[1-9])\)([0-9]{3})-([0-9]{2})-([0-9]{2})#';
$patternLevelUp = '#^\(?\+?(38|8)?\)? ?\(?0\)? ?(39|50|6[3678]|73|9[1-9])\)?(-| )?([0-9]{3})(-| )?([0-9]{2})(-| )?([0-9]{2})#';

// form data

if (isset($_POST['submit'])) {
    $pattern = $$_POST['submit'];

    if (!empty($_POST['phone'])) {
        $phone = trim($_POST['phone']);
    } else {
        $phone = $defaultNumber[rand(0, 8)];
    }

    if (preg_match($pattern, $phone, $rezult)) {
        $code = [
            'patternStrict' => "$rezult[1]",
            'patternLevelUp' => '0' . $rezult[2]
        ];
        $checkNumber = 'Номер обслуживается мобильным оператором - ' . $operator[$code[$_POST['submit']]];
    } else {
        $checkNumber = ' Что-то пошло не так.';
    }
}

// form view

echo '<form action="/regular.php" method="POST">
    <p>Номер мобильного телефона в Украине*</p>
    <input type="tel" name="phone" placeholder="+38(0__)___-__-__" value="' . $phone . '" /><br>'
 . $checkNumber . '<br><br>
    <button name="submit" value="patternStrict"/><b>Строгий<br> шаблон</b></button>
    <button name="submit" value="patternLevelUp"/><b>Лояльный<br> шаблон</b></button>
<p>* При нажатии кнопки с пустой формой, результатом будет проверка 1-го случайного номера из списка в задании.</p>
</form>';